tap "aws/tap"
tap "go-swagger/go-swagger"
tap "homebrew/bundle"
tap "stuartleeks/tap"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# C Foreign Function Interface for Python
brew "cffi"
# Cross-platform make
brew "cmake"
# Utility that creates projects from templates
brew "cookiecutter"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Utility for exporting data from Ente and decrypt the export from Ente Auth
brew "ente-cli"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Database migrations CLI tool
brew "golang-migrate"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# AV1 encoder
brew "svt-av1"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# CLI for working with Visual Studio Code devcontainers
brew "stuartleeks/tap/devcontainer"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# User-friendly GUI app for Homebrew
cask "applite"
# Web browser focusing on privacy
cask "brave-browser"
# Design tool
cask "canva"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Desktop client for Ente Auth
cask "ente-auth"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Desktop client for GitHub repositories
cask "github"
# GitHub notifications on your menu bar
cask "gitify"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# MySQL/MariaDB database management
cask "sequel-ace"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# SSH client
cask "termius"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "1Password for Safari", id: 1569813296
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "OneDrive", id: 823766827
mas "RunCat", id: 1429033973
mas "Swift Playground", id: 1496833156
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
vscode "1password.op-vscode"
vscode "atsushieno.language-review"
vscode "corschenzi.mermaid-graphical-editor"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "gdp.delugelang"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kaiwood.endwise"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "openai.chatgpt"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "simonsiefke.svg-preview"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vsls-contrib.gistfs"
