# Taps
tap "aws/tap"
tap "dotenvx/brew"
tap "go-swagger/go-swagger"
tap "homebrew/bundle"

# Formulae (explicitly installed)
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Display directories as trees (with optional color/HTML output)
brew "tree"

# Casks
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
